In [1]:
import pandas as pd
import numpy as np

In [2]:
dictData = {
    'CA':10,
    'MX':1,
    'TX':20,
    'NY':29,
    'LA':20
}

In [3]:
obj3 = pd.Series(dictData)

In [4]:
obj3

CA    10
MX     1
TX    20
NY    29
LA    20
dtype: int64

 a Series is as a fixed-length, ordered dict, as it is a mapping of index values to data values
 
 key : index
 values :values

When you are only passing a dict, the index in the resulting Series will have the dict’s
keys in sorted order. You can override this by passing the dict keys in the order you
want them to appear in the resulting Series:

In [5]:
states = ['CALI','NY','LA','TX','MX']

In [6]:
obj4 = pd.Series(dictData,index = states)

In [7]:
obj4

CALI     NaN
NY      29.0
LA      20.0
TX      20.0
MX       1.0
dtype: float64

In [8]:
obj4.isnull()

CALI     True
NY      False
LA      False
TX      False
MX      False
dtype: bool

In [9]:
obj4.notnull()

CALI    False
NY       True
LA       True
TX       True
MX       True
dtype: bool

In [10]:
obj3

CA    10
MX     1
TX    20
NY    29
LA    20
dtype: int64

In [11]:
obj4

CALI     NaN
NY      29.0
LA      20.0
TX      20.0
MX       1.0
dtype: float64

In [12]:
obj4+obj3

CA       NaN
CALI     NaN
LA      40.0
MX       2.0
NY      58.0
TX      40.0
dtype: float64

Both the Series object itself and its index have a name attribute, which integrates with
other key areas of pandas functionality

In [13]:
obj4.name = 'population'
obj4

CALI     NaN
NY      29.0
LA      20.0
TX      20.0
MX       1.0
Name: population, dtype: float64

In [14]:
obj4.index.name = 'city'

In [15]:
obj4

city
CALI     NaN
NY      29.0
LA      20.0
TX      20.0
MX       1.0
Name: population, dtype: float64

A Series’s index can be altered in-place by assignment:

In [16]:
obj4.index = ['bob','carla','zoe','merci','alice']

In [17]:
obj4

bob       NaN
carla    29.0
zoe      20.0
merci    20.0
alice     1.0
Name: population, dtype: float64

# Filtering Out Missing Data

dropna Filter axis labels based on whether values for each label have missing data, with varying thresholds for how
much missing data to tolerate.

fillna Fill in missing data with some value or using an interpolation method such as 'ffill' or 'bfill'.

isnull Return boolean values indicating which values are missing/NA.

notnull Negation of isnull

In [5]:
from numpy import nan as NA

In [6]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [7]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [8]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

With DataFrame objects, things are a bit more complex. You may want to drop rows
or columns that are all NA or only those containing any NAs. dropna by default drops
any row containing a missing value:

In [10]:
 data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 5, 23]])

In [11]:
data

     0    1     2
0  1.0  6.5   3.0
1  1.0  NaN   NaN
2  NaN  NaN   NaN
3  NaN  5.0  23.0

In [12]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

<!-- Passing how='all' will only drop rows that are all NA: -->

# Passing how='all' will only drop rows that are all NA:

In [26]:
data.dropna(how='all')

     0    1     2
0  1.0  6.5   3.0
1  1.0  NaN   NaN
3  NaN  5.0  23.0

In [27]:
data[4] = NA

# data[] - column

In [28]:
data

     0    1     2   4
0  1.0  6.5   3.0 NaN
1  1.0  NaN   NaN NaN
2  NaN  NaN   NaN NaN
3  NaN  5.0  23.0 NaN

# To drop columns in the same way, pass axis=1:

In [29]:
data.dropna(how='all',axis=1)

     0    1     2
0  1.0  6.5   3.0
1  1.0  NaN   NaN
2  NaN  NaN   NaN
3  NaN  5.0  23.0

### a. Suppose  you want to keep only rows containing a certain number of observations. You can indicate this with the thresh argument

In [30]:
data

     0    1     2   4
0  1.0  6.5   3.0 NaN
1  1.0  NaN   NaN NaN
2  NaN  NaN   NaN NaN
3  NaN  5.0  23.0 NaN

In [31]:
data.dropna(thresh = 2)

# itshould atleast contain 2 non null values

     0    1     2   4
0  1.0  6.5   3.0 NaN
3  NaN  5.0  23.0 NaN

In [32]:
data.dropna(thresh = 2)

     0    1     2   4
0  1.0  6.5   3.0 NaN
3  NaN  5.0  23.0 NaN

# 2. Filling In Missing Data

In [33]:
data

     0    1     2   4
0  1.0  6.5   3.0 NaN
1  1.0  NaN   NaN NaN
2  NaN  NaN   NaN NaN
3  NaN  5.0  23.0 NaN

In [34]:
data.fillna(0)

     0    1     2    4
0  1.0  6.5   3.0  0.0
1  1.0  0.0   0.0  0.0
2  0.0  0.0   0.0  0.0
3  0.0  5.0  23.0  0.0

# Calling fillna with a dict, you can use a different fill value for each column

In [35]:
fill = {0:0.5,
        1:0,
       2:1}

In [36]:
data

     0    1     2   4
0  1.0  6.5   3.0 NaN
1  1.0  NaN   NaN NaN
2  NaN  NaN   NaN NaN
3  NaN  5.0  23.0 NaN

In [37]:
data.fillna(fill)

     0    1     2   4
0  1.0  6.5   3.0 NaN
1  1.0  0.0   1.0 NaN
2  0.5  0.0   1.0 NaN
3  0.5  5.0  23.0 NaN

# Calling fillna with a dict, you can use a different fill value for each column

In [38]:
data1 = data.copy()

In [39]:
data1.fillna(fill,inplace=True)

In [40]:
data1

     0    1     2   4
0  1.0  6.5   3.0 NaN
1  1.0  0.0   1.0 NaN
2  0.5  0.0   1.0 NaN
3  0.5  5.0  23.0 NaN

# The same interpolation methods available for reindexing can be used with fillna:

# ffill 

# bfill

In [41]:
data

     0    1     2   4
0  1.0  6.5   3.0 NaN
1  1.0  NaN   NaN NaN
2  NaN  NaN   NaN NaN
3  NaN  5.0  23.0 NaN

In [42]:
data.fillna(method='ffill')

# the above values are interpolated

     0    1     2   4
0  1.0  6.5   3.0 NaN
1  1.0  6.5   3.0 NaN
2  1.0  6.5   3.0 NaN
3  1.0  5.0  23.0 NaN

In [43]:
# limiting the interpolation

data.fillna(method = 'ffill',limit =1)

     0    1     2   4
0  1.0  6.5   3.0 NaN
1  1.0  6.5   3.0 NaN
2  1.0  NaN   NaN NaN
3  NaN  5.0  23.0 NaN

In [44]:
data.loc[0,4] = 7

In [45]:
data

     0    1     2    4
0  1.0  6.5   3.0  7.0
1  1.0  NaN   NaN  NaN
2  NaN  NaN   NaN  NaN
3  NaN  5.0  23.0  NaN

In [46]:
data.fillna(method = 'ffill',limit =1)

     0    1     2    4
0  1.0  6.5   3.0  7.0
1  1.0  6.5   3.0  7.0
2  1.0  NaN   NaN  NaN
3  NaN  5.0  23.0  NaN

In [47]:
data

     0    1     2    4
0  1.0  6.5   3.0  7.0
1  1.0  NaN   NaN  NaN
2  NaN  NaN   NaN  NaN
3  NaN  5.0  23.0  NaN

In [48]:
data.fillna(method = 'bfill')

     0    1     2    4
0  1.0  6.5   3.0  7.0
1  1.0  5.0  23.0  NaN
2  NaN  5.0  23.0  NaN
3  NaN  5.0  23.0  NaN

In [55]:
data

     0    1     2    4
0  1.0  6.5   3.0  7.0
1  1.0  NaN   NaN  NaN
2  NaN  NaN   NaN  NaN
3  NaN  5.0  23.0  NaN

In [57]:
data.fillna(method='pad') 
data.fillna(method='ffill')

      0     1     2     4
0  True  True  True  True
1  True  True  True  True
2  True  True  True  True
3  True  True  True  True

In [49]:
# filling with stat values

data.fillna(data.mean())

     0     1     2    4
0  1.0  6.50   3.0  7.0
1  1.0  5.75  13.0  7.0
2  1.0  5.75  13.0  7.0
3  1.0  5.00  23.0  7.0

In [50]:
data.mean() 
# column wise

0     1.00
1     5.75
2    13.00
4     7.00
dtype: float64

In [51]:
data

     0    1     2    4
0  1.0  6.5   3.0  7.0
1  1.0  NaN   NaN  NaN
2  NaN  NaN   NaN  NaN
3  NaN  5.0  23.0  NaN

In [52]:
data.mode()[0]

0    1.0
1    NaN
Name: 0, dtype: float64

In [53]:
data

     0    1     2    4
0  1.0  6.5   3.0  7.0
1  1.0  NaN   NaN  NaN
2  NaN  NaN   NaN  NaN
3  NaN  5.0  23.0  NaN

# Removing Duplicates

In [13]:
df = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                   'k2': [1, 1, 2, 3, 3, 4, 4]})

In [14]:
df

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [59]:
df.duplicated()

# The DataFrame method duplicated returns a boolean Series indicating

# whether each row is a duplicate (has been observed in a previous row) or not

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

# Relatedly, drop_duplicates returns a DataFrame where the duplicated array is False:

In [61]:
df

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [60]:
df.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

# you can specify any subset of them to detect duplicates

In [62]:
df['v1'] = range(7)

In [63]:
df

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [67]:
df.drop_duplicates(['k2'])

# unique values are one and two so other than that delete duplicates

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

# duplicated and drop_duplicates by default keep the first observed value combination.
# Passing keep='last' will return the last one:

In [73]:
df.drop_duplicates(['k1'],keep='last')

    k1  k2  v1
4  one   3   4
6  two   4   6

In [71]:
df

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

##### keep{‘first’, ‘last’, False}, default ‘first’


##### Determines which duplicates (if any) to

##### keep. - first : Drop duplicates except for the first occurrence. - 

##### last : Drop duplicates except for the last occurrence. -

##### False : Drop all duplicates.

# Transforming Data Using a Function or Mapping

In [80]:
cont = {
    'food' : ['Beans','Apple','Carrot','Potato','pomogranate','curd','beans'],
    'ounces' : [1,2,3,1,2,5,2]
}

In [81]:
data = pd.DataFrame(cont)

In [82]:
data

          food  ounces
0        Beans       1
1        Apple       2
2       Carrot       3
3       Potato       1
4  pomogranate       2
5         curd       5
6        beans       2

In [83]:
food_to_prod = {
    'beans' : 'vegie',
    'apple':'fruit',
    'carrot':'vegie',
    'potato':'vegie',
    'pomogranate': ' fruit',
    'curd':'dairy'}

In [85]:
lowercased = data['food'].str.lower()

In [86]:
data['product'] = lowercased.map(food_to_prod)

In [87]:
data

          food  ounces product
0        Beans       1   vegie
1        Apple       2   fruit
2       Carrot       3   vegie
3       Potato       1   vegie
4  pomogranate       2   fruit
5         curd       5   dairy
6        beans       2   vegie

In [89]:
# aliter
data['food'].map(lambda x : food_to_prod[x.lower()])

0     vegie
1     fruit
2     vegie
3     vegie
4     fruit
5     dairy
6     vegie
Name: food, dtype: object

In [90]:
data

          food  ounces product
0        Beans       1   vegie
1        Apple       2   fruit
2       Carrot       3   vegie
3       Potato       1   vegie
4  pomogranate       2   fruit
5         curd       5   dairy
6        beans       2   vegie

### Using map is a convenient way to perform element-wise transformations  and other data cleaning–related operations.

# Replacing Values

In [91]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [92]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [93]:
data.replace(-999.,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [94]:
data.replace([-999.,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [96]:
data.replace([-999.,-1000.],[0,np.nan])

0    1.0
1    0.0
2    2.0
3    0.0
4    NaN
5    3.0
dtype: float64

# The argument passed can also be a dict:

In [97]:
data.replace({-999.:0,
             -1000.0:np.nan})

0    1.0
1    0.0
2    2.0
3    0.0
4    NaN
5    3.0
dtype: float64

# Renaming Axis Indexes

In [111]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   columns =['one','two','three','four'],
                   index = ['Ohio','Colorado','New York'])

In [112]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [113]:
transform = lambda x : x[:].upper()

In [114]:
data.index = data.index.map(transform)

In [115]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [121]:
data.rename(index = str.title,
           columns = str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [125]:
data.rename(index = {'OHIO':'Texas'},
           columns = {'three':"renamed index"},
           inplace=True)

In [126]:
data

          one  two  renamed index  four
Texas       0    1              2     3
COLORADO    4    5              6     7
NEW YORK    8    9             10    11

# Discretization and Binning

In [127]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [128]:
bins = [18,25,35,60,100]

In [130]:
cats = pd.cut(ages,bins)

In [131]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

The object pandas returns is a special Categorical object. The output you see
describes the bins computed by pandas.cut. You can treat it like an array of strings
indicating the bin name;

In [132]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [134]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [135]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

Consistent with mathematical notation for intervals, a parenthesis means that the side
is open, while the square bracket means it is closed (inclusive). You can change which
side is closed by passing right=False:

In [136]:
cats1 = pd.cut(ages,bins,right = False)

In [137]:
cats1

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

### default (  ]
### right  = False [ )

# pass your own bin names

In [138]:
labels = ['Youth','young adults','MiddleAged','Senior']

cuts2 = pd.cut(ages,bins,labels=labels)

In [139]:
cuts2

['Youth', 'Youth', 'Youth', 'young adults', 'Youth', ..., 'young adults', 'Senior', 'MiddleAged', 'MiddleAged', 'young adults']
Length: 12
Categories (4, object): ['Youth' < 'young adults' < 'MiddleAged' < 'Senior']

## If you pass an integer number of bins to it will compute equal-length bins based on the minimum and maximum values in the data

In [165]:
data = np.arange(10)

cuts3 = pd.cut(data,bins=4,precision=2)
cuts3

[(-0.009, 2.25], (-0.009, 2.25], (-0.009, 2.25], (2.25, 4.5], (2.25, 4.5], (4.5, 6.75], (4.5, 6.75], (6.75, 9.0], (6.75, 9.0], (6.75, 9.0]]
Categories (4, interval[float64, right]): [(-0.009, 2.25] < (2.25, 4.5] < (4.5, 6.75] < (6.75, 9.0]]

In [148]:
min(data)

0

In [149]:
max(data)

19

In [157]:
data

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [160]:
cuts3.codes

array([0, 0, 0, 1, 1, 2, 2, 3, 3, 3], dtype=int8)

In [162]:
cuts3.categories

IntervalIndex([(-0.009, 2.25], (2.25, 4.5], (4.5, 6.75], (6.75, 9.0]], dtype='interval[float64, right]')

# qcut, bins the data based on sample quantiles

In [166]:
data = np.random.randn(1000)

cuts4 = pd.qcut(data,q=4)

In [167]:
cuts4

[(0.562, 3.028], (0.562, 3.028], (-3.1279999999999997, -0.728], (0.562, 3.028], (-3.1279999999999997, -0.728], ..., (-0.728, -0.0408], (0.562, 3.028], (-0.728, -0.0408], (-0.0408, 0.562], (-0.728, -0.0408]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.1279999999999997, -0.728] < (-0.728, -0.0408] < (-0.0408, 0.562] < (0.562, 3.028]]

In [170]:
cuts4.value_counts()

(-3.1279999999999997, -0.728]    250
(-0.728, -0.0408]                250
(-0.0408, 0.562]                 250
(0.562, 3.028]                   250
dtype: int64

# can pass your own quantiles (numbers between 0 and 1, inclusive):

In [188]:
cats5 = pd.qcut(data,[0.0,0.1,0.5,0.9,1.])

In [189]:
cats5

[(-0.0408, 1.219], (-0.0408, 1.219], (-3.1279999999999997, -1.336], (1.219, 3.028], (-1.336, -0.0408], ..., (-1.336, -0.0408], (-0.0408, 1.219], (-1.336, -0.0408], (-0.0408, 1.219], (-1.336, -0.0408]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.1279999999999997, -1.336] < (-1.336, -0.0408] < (-0.0408, 1.219] < (1.219, 3.028]]

# Detecting and Filtering Outliers

In [202]:
data = pd.DataFrame(np.random.randn(1000,4))

In [203]:
data

            0         1         2         3
0    0.426278 -0.481979  1.527319  0.465545
1    1.534253 -1.026313  0.669577  0.840759
2    0.119414  0.207192 -0.600681  0.503596
3    0.075396 -1.300818  1.242507 -0.097008
4   -0.988465 -2.466213 -0.050176 -0.451978
..        ...       ...       ...       ...
995 -0.763533 -2.322782  0.135739  0.134372
996 -1.966184 -2.439441  0.374187  1.340519
997 -1.126377  0.173324  0.828483  0.156903
998 -1.349136  0.720154  1.811749 -1.858667
999  0.185734  1.914750  1.080403  2.012959

[1000 rows x 4 columns]

In [195]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.036031     0.017805    -0.021066     0.016965
std       1.033693     0.968735     0.957716     0.990888
min      -2.977186    -3.295531    -2.822872    -2.844009
25%      -0.640614    -0.678380    -0.642981    -0.664639
50%       0.052746     0.015636    -0.024045    -0.015794
75%       0.742095     0.665587     0.618628     0.708596
max       3.587971     3.306752     2.548719     3.794610

# find values in one of the columns exceeding 3 in absolute value

In [205]:
col = data[2]

In [206]:
col[np.abs(col) > 3]

394    3.245241
457    3.308859
701    3.048284
955    3.112223
Name: 2, dtype: float64

# To select all rows having a value exceeding 3 or –3, you can use the any method on a boolean DataFrame:

In [218]:
data[(np.abs(data)>3).any(1)]

# .any(1) is the same as .any(axis=1), which means look row-wise instead of per column.

            0         1         2         3
174  0.052023  0.711574 -0.390273  3.003415
299  0.082396 -3.239063 -1.113505 -0.797359
394 -0.012007  0.271137  3.245241 -1.189240
428 -0.947238  0.251137  0.931306  3.251226
440 -3.110708  0.474072 -0.505456  0.814229
457  0.591134  0.846905  3.308859 -0.969147
497  0.376458  0.798557  1.581879 -3.476722
593 -0.535384 -3.229386  1.127764 -0.570025
701 -1.629734  0.103255  3.048284  0.269311
704  3.042132  0.654931  0.023651  0.790286
855  3.135129 -1.853807  0.350801  0.342892
955 -0.867811  1.588370  3.112223  1.334706
973  0.365142 -0.701325 -0.851605  3.174620

Returns an element-wise indication of the sign of a number.

The sign function returns -1 if x < 0, 0 if x==0, 1 if x > 0. nan is returned for nan inputs.

The statement np.sign(data) produces 1 and –1 values based on whether the values  in data are positive or negative

In [225]:
data[np.abs(data) > 3] = np.sign(data)*3

In [220]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.034749    -0.005260    -0.000517     0.013261
std       0.980810     0.954092     0.970312     0.964623
min      -2.878682    -2.715842    -2.763447    -2.784536
25%      -0.694748    -0.683093    -0.676334    -0.694784
50%      -0.033256     0.025190    -0.037895     0.023459
75%       0.665782     0.652802     0.673869     0.661569
max       2.959552     2.777012     2.977294     2.751294

In [226]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.034749    -0.005260    -0.000517     0.013261
std       0.980810     0.954092     0.970312     0.964623
min      -2.878682    -2.715842    -2.763447    -2.784536
25%      -0.694748    -0.683093    -0.676334    -0.694784
50%      -0.033256     0.025190    -0.037895     0.023459
75%       0.665782     0.652802     0.673869     0.661569
max       2.959552     2.777012     2.977294     2.751294

In [227]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0  1.0
1  1.0 -1.0  1.0  1.0
2  1.0  1.0 -1.0  1.0
3  1.0 -1.0  1.0 -1.0
4 -1.0 -1.0 -1.0 -1.0

# Permutation and Random Sampling